Revit 2027 API
EvaluatedParameter.AsValueString(Document, FormatOptions) Method
 Get the parameter value as a string with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsValueString(
	Document doc,
	FormatOptions options
)
Public Function AsValueString (
	doc As Document,
	options As FormatOptions
) As String
public:
String^ AsValueString(
	Document^ doc,
	FormatOptions^ options
)
member AsValueString :
        doc : Document *
        options : FormatOptions -> string
Parameters
doc Document
 The document to be used to obtain information about the parameter.
options FormatOptions
 Options for formatting the string.
Return Value
String
 The string that represents the parameter value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EvaluatedParameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace